Agat/src/Reports/ДиаграммаНачислений/ДиаграммаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДиаграммаНачислений</name>
</mdclass:Report>

Agat/src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>Перерасчет</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

Agat/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Невыход</name>
      <description>Невыход</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Agat/src/Reports/ДиаграммаНачислений/Forms/ФормаОтчета/Module.bsl
&НаСервереБезКонтекста
Процедура СформироватьНаСервере(Диаграмма)
	// Вставить содержимое обработчика.  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачисленияФактическийПериодДействия.Сотрудник КАК Сотрудник,
	               |	НачисленияФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	               |	НачисленияФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
	               |	НачисленияФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец,
	               |	НачисленияФактическийПериодДействия.Результат КАК Результат,
	               |	НачисленияФактическийПериодДействия.Регистратор КАК Регистратор,
	               |	НачисленияФактическийПериодДействия.Регистратор.Представление КАК РегистраторПредставление
	               |ИЗ
	               |	РегистрРасчета.Начисления.ФактическийПериодДействия КАК НачисленияФактическийПериодДействия";
	
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	
	// Запретить обновление диаграммы.
	Диаграмма.Обновление = Ложь;
	
	Диаграмма.Очистить();
	Диаграмма.ОтображатьЗаголовок = Ложь;
	
	// Заполнить диаграмму.
	Пока ВыборкаРезультата.Следующий() Цикл
		
		// Получить серию, точку и значение для них.
		ТекущаяСерия = Диаграмма.УстановитьСерию(ВыборкаРезультата.ВидРасчета);
		ТекущаяТочка = Диаграмма.УстановитьТочку(ВыборкаРезультата.Сотрудник);
		ТекущееЗначение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
		
		// Создать нужные нам интервалы в значении.
		ТекущийИнтервал = ТекущееЗначение.Добавить();
		ТекущийИнтервал.Начало = ВыборкаРезультата.ПериодДействияНачало;
		ТекущийИнтервал.Конец = ВыборкаРезультата.ПериодДействияКонец;
		ТекущийИнтервал.Текст = ВыборкаРезультата.РегистраторПредставление;
		ТекущийИнтервал.Расшифровка = ВыборкаРезультата.Регистратор; 
		
	КонецЦикла;
	
	// Раскрасить серии своими цветами.
	Для Каждого Серия из Диаграмма.Серии Цикл
		Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
				Серия.Цвет = WEBЦвета.Желтый;	   
				
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия
					Тогда
			Серия.Цвет = WEBЦвета.Зеленый;
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Невыход
					Тогда
			Серия.Цвет = WEBЦвета.Красный;
		КонецЕсли;
		
	КонецЦикла;
	
	// Разрешить обновление диаграммы.
	Диаграмма.Обновление = Истина;		
		
		
			
			
КонецПроцедуры



&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ДиаграммаГанта);   
	
	
	
	
КонецПроцедуры
